Revit 2027 API
DataTransferProgressChangedEventArgs.TotalSize Property
 Total expected data size to transfer, in bytes.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalSize { get; }
Public ReadOnly Property TotalSize As Double
	Get
public:
property double TotalSize {
	double get ();
}
member TotalSize : float with get
Property Value
Double
See Also
Reference
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace